RIET/src/Catalogs/crmContracts/crmContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>crmContracts</name>
  <comment>(rgs)</comment>
  <attributes>
    <name>crmGeoMarket</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmBusinessSegment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmCreatedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmCreatedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmEffectiveDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractCurrency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractValueUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmDFNName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/crmContracts/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для загрузки";
	Диалог.ПредварительныйПросмотр = Ложь;
	Если ФорматФайла = 0 Тогда
		Диалог.Фильтр = "Файл CSV(*.csv)|*.csv";
	Иначе
		Диалог.Фильтр = "Документ Excel (*.xlsx)|*.xlsx|Документ Excel 97-2003 (*.xls)|*.xls";
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда
		Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если НЕ РГСофтКлиентСервер.ФайлДоступенДляЗагрузки(Файл) Тогда
		Возврат;
	КонецЕсли;
		   	
	ЕстьОшибки = Ложь;
	
	ДанныеФайла = Новый ДвоичныеДанные(Файл);
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеФайла);
	
	ЗагрузитьНаСервере(АдресВХранилище, ЕстьОшибки);
	Если Не ЕстьОшибки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(АдресВХранилище, ЕстьОшибки)
	
	ПрочитатьФайл(АдресВХранилище, ЕстьОшибки);
	ЗаписатьДанные();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайл(АдресВХранилище, ЕстьОшибки)
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	КаталогДляЗагрузки = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + "\";
	СоздатьКаталог(КаталогДляЗагрузки);
	Если ФорматФайла = 0 Тогда
		
		ИмяФайла = "ContractsCRM.csv";
		ПолноеИмяФайла = КаталогДляЗагрузки + ИмяФайла;
		ДанныеФайла.Записать(ПолноеИмяФайла);
		
		ФайлСхемы = Новый ТекстовыйДокумент;
		ФайлСхемы.Прочитать(ПолноеИмяФайла);
		ФайлСхемы.Записать(ПолноеИмяФайла, "windows-1251"); 
		
		МакетСхемы = Справочники.crmContracts.ПолучитьМакет("ФайлSchema");
		ФайлСхемы.УстановитьТекст(СтрЗаменить(МакетСхемы.ПолучитьТекст(), "%ИмяФайлаСхемы%", ИмяФайла));
		ФайлСхемы.Записать(КаталогДляЗагрузки + "Schema.ini", "windows-1251");
		
		
		SQLЗапрос = "SELECT * FROM " + ИмяФайла;
		Connection = Новый COMОбъект("ADODB.Connection");

		//Создаем коннект
		Попытка
			СтрокаПодключения = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + КаталогДляЗагрузки + ";Extended Properties=""text;HDR=YES;IMEX=1;FMT=TabDelimited;""";
			Connection.Open(СтрокаПодключения);
		Исключение
			Попытка
				СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + КаталогДляЗагрузки + ";Extended Properties=""text;HDR=YES;IMEX=1;FMT=TabDelimited;""";
				Connection.Open(СтрокаПодключения);
			Исключение
				ЕстьОшибки = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
				Возврат;
			КонецПопытки;		
		КонецПопытки;
	
		rs = Новый COMОбъект("ADODB.Recordset");
		rs = Connection.Execute(SQLЗапрос);
		rs.MoveFirst();
		Пока rs.EOF = 0 Цикл
			НоваяСтрока = ДанныеCRM.Добавить();
			НоваяСтрока.crmContractID = СокрЛП(rs.Fields(104).Value);
			НоваяСтрока.crmCreatedBy = СокрЛП(rs.Fields(101).Value);
			НоваяСтрока.crmCreatedDate = ПолучитьДату(СокрЛП(rs.Fields(100).Value));
			НоваяСтрока.crmEffectiveDate = ПолучитьДату(СокрЛП(rs.Fields(71).Value));
			НоваяСтрока.crmExpiryDate = ПолучитьДату(СокрЛП(rs.Fields(72).Value));
			НоваяСтрока.crmContractCurrency = СокрЛП(rs.Fields(95).Value);
			
			// { RGS MChernetsov 10/25/2016 10:28:10 AM - Геомаркет и Бизнес Сегмент
						
			НоваяСтрока.crmBusinessSegment = СокрЛП(rs.Fields(81).Value);
			НоваяСтрока.crmGeoMarket = СокрЛП(rs.Fields(75).Value);
			
			// } RGS MChernetsov 10/25/2016 10:28:13 AM - Геомаркет и Бизнес Сегмент
			
			crmContractValueUSD = СокрЛП(СтрЗаменить(rs.Fields(90).Value, ",", ""));
			Если ЗначениеЗаполнено(crmContractValueUSD) Тогда
				Попытка
					Если Лев(crmContractValueUSD, 1) = "(" И Прав(crmContractValueUSD, 1) = ")" Тогда
						НоваяСтрока.crmContractValueUSD = - Число(Сред(crmContractValueUSD, 2, СтрДлина(crmContractValueUSD) - 2));
				    Иначе
						НоваяСтрока.crmContractValueUSD = Число(crmContractValueUSD);
					КонецЕсли;
				Исключение
					НоваяСтрока.crmContractValueUSD = 0;
					ЕстьОшибки = Истина;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не удалось преобразовать к числу значение " + rs.Fields(90).Value + ". CRM Contract ID - " + НоваяСтрока.crmContractID;
					Сообщение.Сообщить();
				КонецПопытки;
			Иначе
				НоваяСтрока.crmContractValueUSD = 0;
			КонецЕсли;
			НоваяСтрока.Наименование = СокрЛП(rs.Fields(85).Value);
			
			rs.MoveNext();
		КонецЦикла;
		
		rs.Close();
		Connection.Close();
	Иначе
		ИмяФайла = "ContractsCRM.xls";
		ПолноеИмяФайла = КаталогДляЗагрузки + ИмяФайла;
		ДанныеФайла.Записать(ПолноеИмяФайла);
		
		// Открываем файл
		Connection = Новый COMОбъект("ADODB.Connection");
		СтрокаПодключения = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + ПолноеИмяФайла + ";Extended Properties=""Excel 12.0;HDR=No;IMEX=1""";	
		Попытка 
			Connection.Open(СтрокаПодключения);	
		Исключение
			// если подключение не удалось, то пытаемся подключиться к файлу через Microsoft.Jet.OLEDB.4.0
			Попытка
				СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + ПолноеИмяФайла + ";Extended Properties=""Excel 8.0;HDR=No;IMEX=1""";
	            Connection.Open(СтрокаПодключения);
			Исключение
			    Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
			    Сообщение.Сообщить();
				Возврат
			КонецПопытки;
		КонецПопытки;
		rs = Новый COMObject("ADODB.RecordSet");
		rs.ActiveConnection = Connection;
		rs = Connection.OpenSchema(20);
		sqlString = "select * from [" + rs.Fields("Table_Name").Value+ "]";
		rs.Close();
		rs.Open(sqlString);
		
		rs.MoveFirst();
		rs.MoveNext();
		Пока rs.EOF = 0 Цикл
			НоваяСтрока = ДанныеCRM.Добавить();
			НоваяСтрока.crmContractID = СокрЛП(rs.Fields(104).Value);
			НоваяСтрока.crmCreatedBy = СокрЛП(rs.Fields(101).Value);
			НоваяСтрока.crmCreatedDate = ПолучитьДату(СокрЛП(rs.Fields(100).Value));
			НоваяСтрока.crmEffectiveDate = ПолучитьДату(СокрЛП(rs.Fields(71).Value));
			НоваяСтрока.crmExpiryDate = ПолучитьДату(СокрЛП(rs.Fields(72).Value));
			НоваяСтрока.crmContractCurrency = СокрЛП(rs.Fields(95).Value);
			
			// { RGS MChernetsov 10/25/2016 10:28:10 AM - Геомаркет и Бизнес Сегмент
						
			НоваяСтрока.crmBusinessSegment = СокрЛП(rs.Fields(81).Value);
			НоваяСтрока.crmGeoMarket = СокрЛП(rs.Fields(75).Value);
			
			// } RGS MChernetsov 10/25/2016 10:28:13 AM - Геомаркет и Бизнес Сегмент
			
			Если ЗначениеЗаполнено(rs.Fields(90).Value) Тогда
				Попытка
					НоваяСтрока.crmContractValueUSD = Число(СокрЛП(rs.Fields(90).Value));
				Исключение
					НоваяСтрока.crmContractValueUSD = 0;
					ЕстьОшибки = Истина;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не удалось преобразовать к числу значение " + rs.Fields(90).Value + ". CRM Contract ID - " + НоваяСтрока.crmContractID;
					Сообщение.Сообщить();
				КонецПопытки;
			Иначе
				НоваяСтрока.crmContractValueUSD = 0;
			КонецЕсли;
			НоваяСтрока.Наименование = СокрЛП(rs.Fields(85).Value);
			
			rs.MoveNext();
		КонецЦикла;
		
		rs.Close();
		Connection.Close();
	КонецЕсли;
	УдалитьФайлы(КаталогДляЗагрузки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДату(ДатаСтрокой)
	
	Если СтрНайти(ДатаСтрокой, ":") > 0 Тогда
		//Час = 0;
		Если Прав(ДатаСтрокой, 2) = "PM" Тогда
			//Час = 12;
			ДатаСтрокой = СокрЛП(Лев(ДатаСтрокой, СтрДлина(ДатаСтрокой) - 2));
		ИначеЕсли Прав(ДатаСтрокой, 2) = "AM" Тогда
			ДатаСтрокой = СокрЛП(Лев(ДатаСтрокой, СтрДлина(ДатаСтрокой) - 2));
		КонецЕсли;
		Если СтрНайти(ДатаСтрокой, "/") > 0 Тогда
			Разделитель = "/";
		ИначеЕсли СтрНайти(ДатаСтрокой, ".") > 0 Тогда
			Разделитель = ".";
		Иначе
			Возврат Дата("00010101000000");
		КонецЕсли;
		МассивДаты = СтрРазделить(ДатаСтрокой, Разделитель);
		Если МассивДаты.Количество() = 3 Тогда
			Если Разделитель = "." Тогда
				День = Число(СокрЛП(МассивДаты[0]));
				Месяц = Число(СокрЛП(МассивДаты[1]));
			Иначе
				День = Число(СокрЛП(МассивДаты[1]));
				Месяц = Число(СокрЛП(МассивДаты[0]));
			КонецЕсли;
			Год = Число(Лев(СокрЛП(МассивДаты[2]),4));
			
			//Время = СокрЛП(МассивДаты[2]);
			//Время = СокрЛП(Прав(Время, СтрДлина(Время) - 4));
			//МассивВремени = СтрРазделить(Время, ":");
			//Если МассивВремени.Количество() = 3 Тогда
			//	Час = Час + Число(МассивВремени[0]);
			//	Минута = Число(МассивВремени[1]);
			//	Секунда = Число(МассивВремени[2]);
			//Иначе
			//	Возврат Дата("00010101000000");
			//КонецЕсли;
			
			Возврат Дата(Год, Месяц, День);
		Иначе
			Возврат Дата("00010101000000");
		КонецЕсли;
	Иначе
		Если СтрНайти(ДатаСтрокой, "/") > 0 Тогда
			Разделитель = "/";
		ИначеЕсли СтрНайти(ДатаСтрокой, ".") > 0 Тогда
			Разделитель = ".";
		Иначе
			Возврат Дата("00010101000000");
		КонецЕсли;
		МассивДаты = СтрРазделить(ДатаСтрокой, Разделитель);
		Если МассивДаты.Количество() = 3 Тогда
			Если Разделитель = "." Тогда
				День = Число(СокрЛП(МассивДаты[0]));
				Месяц = Число(СокрЛП(МассивДаты[1]));
			Иначе
				День = Число(СокрЛП(МассивДаты[1]));
				Месяц = Число(СокрЛП(МассивДаты[0]));
			КонецЕсли;
			Год = Число(СокрЛП(МассивДаты[2]));
			
			Возврат Дата(Год, Месяц, День);
		Иначе
			Возврат Дата("00010101000000");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаписатьДанные()
	
	Для Каждого текСтрока Из ДанныеCRM Цикл
		текКонтракт = Справочники.crmContracts.НайтиПоКоду(текСтрока.crmContractID);
		Если ЗначениеЗаполнено(текКонтракт) Тогда
			текОбъект = текКонтракт.ПолучитьОбъект();
		Иначе
			текОбъект = Справочники.crmContracts.СоздатьЭлемент();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(текОбъект, текСтрока);
		текОбъект.Код = текСтрока.crmContractID;
		текОбъект.ОбменДанными.Загрузка = Истина;
		текОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ФорматФайлаПриИзменении(Элемент)
	
	Файл = "";
	
КонецПроцедуры
